### LSE Data Analytics Online Career Accelerator 

# DA201:  Data Analytics with Python

## Application of the map() function (tutorial video)

This file contains the code snippets that are introduced in the 'Application of the map() function' video. 
Follow along with the demonstration to: 
- change data types in a DataFrame
- change a column heading in a DataFrame.

Play and pause the video to follow along with the demonstration.

### 1. Import pandas and create a DataFrame

In [1]:
# Import Pandas.
import pandas as pd

# Read the CSV files from the current working directory.
classlist_a = pd.read_csv('classlist_a.csv')
classlist_b = pd.read_csv('classlist_b.csv')
classlist_c = pd.read_csv('classlist_c.csv')
classlist_d = pd.read_csv('classlist_d.csv')

# Concatenate the four class lists.
classlist = pd.concat([classlist_a, classlist_b, classlist_c, classlist_d])

# View the new DataFrame.b
print(classlist.shape)
print(classlist.columns)
print(classlist.dtypes)

(675, 5)
Index(['Student number', 'Surname', 'Initials', 'Final mark', 'Class'], dtype='object')
Student number      int64
Surname            object
Initials           object
Final mark        float64
Class              object
dtype: object

### 2. Change the values from strings to integers

In [2]:
# Use the map() function only on a Pandas Series i.e. a single column.
# Change the values from strings to integers.
classlist['Class_num'] = classlist.Class.map({'A':0, 'E':1})

# View the DataFrame.
print(classlist.shape)
classlist.head()

(675, 6)

   Student number    Surname Initials  Final mark Class  Class_num
0        15476227     AFONSO        L       47.72     E          1
1        15311279   ALBERTYN    F J H       57.52     A          0
2        15637913  ALEXANDER        L       90.68     E          1
3        15124150        BAM      A J       56.43     E          1
4        15829626     BARROW      S B       79.64     E          1

### 3. Compare the two class columns

In [3]:
# Compare the columns Class and Class_num with the loc() function.
print(classlist.loc[:, ['Class', 'Class_num']])

# Compare the columns Class and Class_num with the iloc() function.
classlist.iloc[:, 4:6]

    Class  Class_num
0       E          1
1       A          0
2       E          1
3       E          1
4       E          1
..    ...        ...
214     E          1
215     E          1
216     A          0
217     E          1
218     E          1

[675 rows x 2 columns]

    Class  Class_num
0       E          1
1       A          0
2       E          1
3       E          1
4       E          1
..    ...        ...
214     E          1
215     E          1
216     A          0
217     E          1
218     E          1

[675 rows x 2 columns]

### 4. Change the column heading

In [4]:
classlist_final = classlist.rename(columns={'Final mark':'Final_mark'})

classlist_final.head()

   Student number    Surname Initials  Final_mark Class  Class_num
0        15476227     AFONSO        L       47.72     E          1
1        15311279   ALBERTYN    F J H       57.52     A          0
2        15637913  ALEXANDER        L       90.68     E          1
3        15124150        BAM      A J       56.43     E          1
4        15829626     BARROW      S B       79.64     E          1